mafia-server/app/controllers/rooms_controller.rb

  def index
    if @current_user.present?
      @rooms = Room.all
---
SELECT "rooms".* FROM "rooms"