mafia-server/app/controllers/users_controller.rb

def create
  user = User.create user_params
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Charlie"], ["password_digest", "$2a$10$7d/FCT1uSu2h7FT8I/WW..6wBnaapbswdimEFw2L8ZK.KaX9Zq1O."], ["created_at", "2018-06-08 08:18:15.062117"], ["updated_at", "2018-06-08 08:18:15.062117"]]

def update
  if @current_user.update user_params
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Alex2"], ["updated_at", "2018-06-08 08:09:45.107726"], ["id", 1]]